{
"1984": "George Orwell's novel follows Winston Smith in a surveillance state where history is rewritten and language is weaponized. As Winston rebels through forbidden love and thought, the regime crushes individuality, asking whether truth can survive when power controls memory.",
"The Hobbit": "Bilbo Baggins is recruited by Gandalf and a band of dwarves to reclaim their mountain home from Smaug. Along the road of trolls, goblins, riddles with Gollum, and spiders of Mirkwood, Bilbo grows from reluctant bystander to clever hero, discovering courage and compassion.",
"Harry Potter and the Philosopher's Stone": "Harry learns he is a wizard and attends Hogwarts with friends Ron and Hermione. As he uncovers the mystery of the Philosopher's Stone, loyalty and bravery help him face Voldemort's return and choose the kind of person he wants to be.",
"The Fellowship of the Ring": "Frodo inherits the One Ring and, with a fellowship of allies, sets out to destroy it in Mordor. The quest tests loyalties and reveals the corrupting influence of power, as each member must decide what they will sacrifice for the common good.",
"Pride and Prejudice": "Elizabeth Bennet navigates family pressures and class expectations while sparring with Mr. Darcy. Misjudgments give way to self‑knowledge, showing how pride and prejudice shape—and can distort—love and reputation.",
"To Kill a Mockingbird": "Through Scout's eyes in 1930s Alabama, the trial of Tom Robinson exposes entrenched racism. Guided by Atticus Finch's moral clarity, the children confront fear and learn empathy amid a community divided by prejudice.",
"The Alchemist": "A shepherd follows recurring omens across desert and sea, learning from a king, an alchemist, and the world itself. The journey reframes treasure as the act of pursuing one's Personal Legend with courage and humility.",
"The Book Thief": "Narrated by Death, Liesel steals books to find comfort while her foster family hides a Jewish man. Words become both refuge and resistance as war reshapes her neighborhood and the people she loves.",
"All Quiet on the Western Front": "Paul Bäumer and classmates enlist with naive patriotism that the trenches swiftly erode. The novel depicts mud, fear, and dehumanization with unsentimental clarity, mourning a lost generation.",
"The Name of the Wind": "Kvothe, a prodigy with music and magic, recounts hardship, university life, and the pursuit of the Chandrian who shattered his childhood, revealing both genius and the costs of obsession.",
"The Lion, the Witch and the Wardrobe": "The Pevensie children stumble into Narnia, where endless winter yields to sacrifice and renewal. Themes of faith, forgiveness, and courage guide their struggle against tyranny.",
"The Kite Runner": "From Kabul to California and back, Amir seeks atonement for betraying his friend Hassan. The story weaves personal guilt with Afghanistan's upheavals, asking if redemption is ever too late."
}